<?php
    pr1(); // массивы чтение, добавление и удаление (CRUD операции)

    // массивы чтение, добавление и удаление (CRUD операции)
    function pr1(){
        $grades = [
            'Иван' => ['математика' => 4, 'физика' => 5, 'химия' => 3],
            'Ольга' => ['математика' => 5, 'физика' => 4, 'химия' => 4],
            'Пётр' => ['математика' => 3, 'физика' => 3, 'химия' => 5],
        ];

        function add_student($grades,$math, $fiz, $him){
            // .... код функции
        }

        // просто для вывода массива
        function show_array($arr){
            echo "<pre>";
            print_r($arr);
            echo "</pre>";
        }

        add_student($grades, 4, 5, 3);
        show_array($grades);
        
    }